Update docs to remove Tailwind references
